# 인터넷 네트워크

- 인터넷 통신
- Ip
- tcp, udp
- port
- dns

## 인터넷 통신

클라 -> 인터넷(노드로 구성이 되어있음) -> 서버

인터넷이 데이터를 전송하는데 규칙(룰)이 필요한데 이 규칙을 프로토콜이라 칭함
인터넷은 단순히 하나의 규칙(프로토콜)만 사용하는 것이 아닌 IP, TCP등 여러가지가 있음

## IP (인터넷 프로토콜의 역할)

 - 지정한 Ip 주소에 데이터 전달
 - 패킷이라는 통신 단위로 데이터 전달

```
IP 프로토콜의 한계

1. 비연결성 (받을 대상이 없어도 패킷 발송)
2. 비신뢰성 (중간에 패킷 손실 및 도착 순서 보장X)
3. 프로그램 구분 (같은 ip를 사용하는 서버에서 통신하는 애플리케이션 구분X)

```

## TCP, UDP

인터넷 프로토콜 스택 4계층
어플리케이션 계층 HTTP,FTP
전송 계층 TCP,UDP
인터넷 계층 IP
네트워크 인터페이스 계층

전송 계층의 룰
TCP는 IP프로토콜의 한계를 해결하는 프로토콜 (연결상태 획인 및 순서에 대한 태킹 및 포트로 애플리케이션 구분)

연결지향 - TCP 3 way handshake (가상 연결)
데이터 전달 보증
순서 보장

신뢰할 수 있는 프로토콜
현재는 대부분 TCD 사용

UDP
 -> 데이터 전달 및 순서 보장 X
 -> 단순하고 빠름
 -> IP에서 포트만 추가

## PORT
한번에 둘이상 연결 하면 어떻게?(하나의 서버에서 혹은 하나의 클라이언트에서 여러가지 서버로 통신할때)
 - 포트로 application을 구분
 
## DNS
 도메인명을 통해 IP를 응답해주는 서버
 전화번호부
 

